nums = {
    # единицы
    'ноль': (0, 1),
    'один': (1, 1),
    'два': (2, 1),
    'три': (3, 1),
    'четыре': (4, 1),
    'пять': (5, 1),
    'шесть': (6, 1),
    'семь': (7, 1),
    'восемь': (8, 1),
    'девять': (9, 1),

    # десятки
    'десять': (10, 1),
    'одиннадцать': (11, 1),
    'двенадцать': (12, 1),
    'тринадцать': (13, 1),
    'четырнадцать': (14, 1),
    'пятнадцать': (15, 1),
    'шестнадцать': (16, 1),
    'семнадцать': (17, 1),
    'восемнадцать': (18, 1),
    'девятнадцать': (19, 1),

    'двадцать': (20, 2),
    'тридцать': (30, 2),
    'сорок': (40, 2),
    'пятьдесят': (50, 2),
    'шестьдесят': (60, 2),
    'семьдесят': (70, 2),
    'восемьдесят': (80, 2),
    'девяносто': (90, 2),

    # сотни
    'сто': (100, 3),
    'двести': (200, 3),
    'триста': (300, 3),
    'четыреста': (400, 3),
    'пятьсот': (500, 3),
    'шестьсот': (600, 3),
    'семьсот': (700, 3),
    'восемьсот': (800, 3),
    'девятьсот': (900, 3),

}

rank = {
    'единица': (1, 1),
    'десятка': (10, 2),
    'сотня': (100, 3),
    'тысяча': (1000, 4),
    'миллион': (1000000, 5)
}
